In [3]:
import pandas as pd

In [6]:
dataframe1 = {"ID": [4, 5, 6],
              "Nome": ["Junco", "Pinto", "Marlison"],
              "Idade": [23, 24, 20]}

df1 = pd.DataFrame(dataframe1)

dataframe2 = {"ID": [1, 2, 3],
              "Nome": ["Amanda", "Clovis", "Mayara"],
              "Idade": [27, 20, 22]}

df2 = pd.DataFrame(dataframe2)

In [11]:
df_concat = pd.concat([df2, df1]).reset_index(drop=True)

In [12]:
df_concat

   ID      Nome  Idade
0   1    Amanda     27
1   2    Clovis     20
2   3    Mayara     22
3   4     Junco     23
4   5     Pinto     24
5   6  Marlison     20